In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [25]:
ranking = pd.read_csv("fifa_ranking.csv")

In [26]:
ranking.head()

,rank,country_full,country_abrv,total_points,previous_points,rank_change,cur_year_avg,cur_year_avg_weighted,last_year_avg,last_year_avg_weighted,two_year_ago_avg,two_year_ago_weighted,three_year_ago_avg,three_year_ago_weighted,confederation,rank_date
0,1,Germany,GER,0.0,57,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,UEFA,1993-08-08
1,2,Italy,ITA,0.0,57,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,UEFA,1993-08-08
2,3,Switzerland,SUI,0.0,50,9,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,UEFA,1993-08-08
3,4,Sweden,SWE,0.0,55,0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,UEFA,1993-08-08
4,5,Argentina,ARG,0.0,51,5,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,CONMEBOL,1993-08-08

In [27]:
ranking = ranking.loc[:,['rank', 'country_full', 'country_abrv', 'cur_year_avg_weighted', 'rank_date', 
                           'two_year_ago_weighted', 'three_year_ago_weighted']]

In [28]:
ranking.head()

,rank,country_full,country_abrv,cur_year_avg_weighted,rank_date,two_year_ago_weighted,three_year_ago_weighted
0,1,Germany,GER,0.0,1993-08-08,0.0,0.0
1,2,Italy,ITA,0.0,1993-08-08,0.0,0.0
2,3,Switzerland,SUI,0.0,1993-08-08,0.0,0.0
3,4,Sweden,SWE,0.0,1993-08-08,0.0,0.0
4,5,Argentina,ARG,0.0,1993-08-08,0.0,0.0

In [29]:
ranking = ranking.replace({"IR Iran": "Iran"})
ranking['rank_date'] = pd.to_datetime(ranking['rank_date'])
ranking['weighted_points'] =  ranking['cur_year_avg_weighted'] + ranking['two_year_ago_weighted'] + ranking['three_year_ago_weighted']

In [30]:
ranking.head()

,rank,country_full,country_abrv,cur_year_avg_weighted,rank_date,two_year_ago_weighted,three_year_ago_weighted,weighted_points
0,1,Germany,GER,0.0,1993-08-08,0.0,0.0,0.0
1,2,Italy,ITA,0.0,1993-08-08,0.0,0.0,0.0
2,3,Switzerland,SUI,0.0,1993-08-08,0.0,0.0,0.0
3,4,Sweden,SWE,0.0,1993-08-08,0.0,0.0,0.0
4,5,Argentina,ARG,0.0,1993-08-08,0.0,0.0,0.0

In [31]:
result = pd.read_csv("results.csv")
result =  result.replace({'Germany DR': 'Germany', 'China': 'China PR'})
result['date'] = pd.to_datetime(result['date'])

In [32]:
result.head()

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False

In [33]:
world_cup = pd.read_csv('World Cup 2018 Dataset.csv')

In [34]:
world_cup = world_cup.loc[:, ['Team', 'Group', 'First match \nagainst', 'Second match\n against', 'Third match\n against']]
world_cup = world_cup.dropna(how='all')
world_cup = world_cup.replace({"IRAN": "Iran", 
                               "Costarica": "Costa Rica", 
                               "Porugal": "Portugal", 
                               "Columbia": "Colombia", 
                               "Korea" : "Korea Republic"})

In [35]:
world_cup.head()

,Team,Group,First match \nagainst,Second match\n against,Third match\n against
0,Russia,A,Saudi Arabia,Egypt,Uruguay
1,Saudi Arabia,A,Russia,Uruguay,Egypt
2,Egypt,A,Uruguay,Russia,Saudi Arabia
3,Uruguay,A,Egypt,Saudi Arabia,Russia
4,Portugal,B,Spain,Morocco,Iran

In [36]:
result = result[result['tournament'] != 'Friendly']

In [37]:
result.head()

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
29,1884-01-26,Northern Ireland,Scotland,0,5,British Championship,Belfast,Ireland,False
30,1884-02-09,Wales,Northern Ireland,6,0,British Championship,Wrexham,Wales,False
31,1884-02-23,Northern Ireland,England,1,8,British Championship,Belfast,Ireland,False
32,1884-03-15,Scotland,England,1,0,British Championship,Glasgow,Scotland,False
33,1884-03-17,Wales,England,0,4,British Championship,Wrexham,Wales,False

In [38]:
import datetime

ranking['year'] = ranking['rank_date'].dt.year
result['year'] = result['date'].dt.year

ranking_sub = ranking[ranking['rank_date'] > '2011-08-24']
result_sub = result[result['date'] > '2011-08-24']

In [39]:
ranking_sub = ranking_sub[['rank', 'country_full', 'weighted_points', 'year']]
ranking_sub = ranking_sub.groupby(['year', 'country_full'], as_index=False).agg({'rank': 'mean', 'weighted_points': 'mean'})

result_sub.head()

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral,year
33492,2011-08-27,Fiji,Tahiti,3,0,Pacific Games,Boulari,New Caledonia,True,2011
33494,2011-08-27,New Caledonia,Vanuatu,5,0,Pacific Games,Nouméa,New Caledonia,False,2011
33496,2011-08-27,Papua New Guinea,Cook Islands,4,0,Pacific Games,Boulari,New Caledonia,True,2011
33497,2011-08-27,Solomon Islands,Guam,7,0,Pacific Games,Nouméa,New Caledonia,True,2011
33498,2011-08-27,Tuvalu,American Samoa,4,0,Pacific Games,Nouméa,New Caledonia,True,2011

In [40]:
result_all = result_sub.merge(ranking_sub, left_on=['home_team', 'year'], right_on=['country_full', 'year'], how='inner')
result_all = result_all.merge(ranking_sub, left_on=['away_team', 'year'], right_on=['country_full', 'year'], how='inner')
result_all.drop(['date', 'tournament', 'city', 'country', 'year', 'country_full_x', 'country_full_y'], axis=1, inplace=True)
result_all.head()

,home_team,away_team,home_score,away_score,neutral,rank_x,weighted_points_x,rank_y,weighted_points_y
0,Fiji,Tahiti,3,0,True,153.75,145.7750,183.0,64.9125
1,New Caledonia,Tahiti,3,1,False,160.00,118.6800,183.0,64.9125
2,New Caledonia,Vanuatu,5,0,False,160.00,118.6800,173.0,92.0500
3,American Samoa,Vanuatu,0,8,True,199.00,15.1775,173.0,92.0500
4,Guam,Vanuatu,1,4,True,188.50,35.8500,173.0,92.0500